html/lc-810-chalkboard-xor-game.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>810. 黑板异或游戏</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">810. 黑板异或游戏</h1>
<p>
<a href="https://leetcode-cn.com/problems/chalkboard-xor-game/">https://leetcode-cn.com/problems/chalkboard-xor-game/</a>
</p>

<p>
这题必须看题解！
</p>

<p>
考虑n个值的情况，假设x1,x2,&#x2026;xn，这时候小红先取
</p>
<ul class="org-ul">
<li>假设 S = x1 ^ x2 ^ x3 &#x2026; xn,
</li>
<li>如果 S = 0, 那么小红立刻胜出
</li>
<li>小红唯一输的可能性是：他取任何一个元素之后，剩下的元素异或出来都是0.
</li>
<li>取走x1剩余异或值是 S ^ x1，取走x2剩余异或值是 S ^ x2 &#x2026;
</li>
<li>如果剩余元素异或出来都是0的话，那么(S ^ x1) ^ (S ^ x2) &#x2026; (S ^ xn), 这个值就是xor(S, n+1).
</li>
<li>如果xor(S, n+1) = 0，而S!=0, 唯一的可能就是n+1是偶数，也就是n是奇数。
</li>
</ul>

<p>
所以如果一开始S!=0的话，如果n是奇数，那么小红肯定会输，否则就是小红胜出。
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-py-def-class">class</span> <span class="org-py-class-name">Solution</span>:
    <span class="org-py-def-class">def</span> <span class="org-function-name">xorGame</span>(<span class="org-py-object-reference">self</span>, nums: List[<span class="org-py-builtins">int</span>]) -&gt; <span class="org-py-builtins">bool</span>:
        <span class="org-py-variable-name">v</span> = <span class="org-py-number">0</span>
        <span class="org-keyword">for</span> x <span class="org-keyword">in</span> nums:
            <span class="org-py-variable-name">v</span> = v ^ x
        <span class="org-keyword">if</span> v != <span class="org-py-number">0</span> <span class="org-keyword">and</span> <span class="org-py-builtins">len</span>(nums) % <span class="org-py-variable-name">2</span> == <span class="org-py-number">1</span>:
            <span class="org-keyword">return</span> <span class="org-py-pseudo-keyword">False</span>
        <span class="org-keyword">return</span> <span class="org-py-pseudo-keyword">True</span>
</pre>
</div>
</div>
</body>
</html>
